import React from "react";

const Blogs = () => {
  return (
    <div className="w-full md:w-4/5 mx-auto my-5">
      <div className="p-3 shadow-lg">
        <h1 className="text-4xl font-semibold">
          Difference between authorization and authentication
        </h1>
        <hr className="my-2" />
        <article className="my-5">
          <p>
            Authentication : প্রমাণীকরণ ব্যবহারকারী কে তা যাচাই করে।পাসওয়ার্ড,
            ওয়ান-টাইম পিন, বায়োমেট্রিক তথ্য এবং ব্যবহারকারীর দ্বারা প্রদত্ত বা
            প্রদত্ত অন্যান্য তথ্যের মাধ্যমে প্রমাণীকরণ কাজ করে। প্রমাণীকরণ একটি
            ভাল পরিচয় এবং অ্যাক্সেস ব্যবস্থাপনা প্রক্রিয়ার প্রথম ধাপ।
            প্রমাণীকরণ ব্যবহারকারীর দ্বারা দৃশ্যমান এবং আংশিকভাবে পরিবর্তনযোগ্য।
            প্রমাণীকরণ প্রক্রিয়ায়, সিস্টেমে অ্যাক্সেস প্রদানের জন্য
            ব্যবহারকারীদের পরিচয় পরীক্ষা করা হয়।
          </p>
          <br />
          <p>
            Authorization: অনুমোদন নির্ধারণ করে কোন ব্যবহারকারী কোন রিসোর্স
            অ্যাক্সেস করতে পারে। অনুমোদন সেই সেটিংসের মাধ্যমে কাজ করে যা সংস্থার
            দ্বারা বাস্তবায়িত এবং রক্ষণাবেক্ষণ করা হয়। অনুমোদন সর্বদা
            প্রমাণীকরণের পরে সঞ্চালিত হয়। অনুমোদন দৃশ্যমান বা ব্যবহারের দ্বারা
            পরিবর্তনযোগ্য নয়। যদিও এই প্রক্রিয়াটি প্রমাণীকরণ প্রক্রিয়ার পরে
            করা হয়।
          </p>
        </article>
        <article className="my-5">
          <h1 className="text-4xl font-semibold">
            Why are you using firebase?
          </h1>
          <hr className="my-2" />
          <p>
            প্রকৃতপক্ষে, ফায়ারবেস ডায়নামিক অ্যাপের জন্য পূর্ণাঙ্গ ব্যাকএন্ড
            কোড লেখার একটি কম প্রযুক্তিগত এবং সময় সাশ্রয়ী বিকল্প। আপনি যদি শেষ
            পর্যন্ত ক্লাউডে আপনার অ্যাপটি হোস্ট এবং পরিচালনা করতে চান তবে আপনি
            এই টুলটি ব্যবহার করার বিষয়েও বিবেচনা করতে পারেন। সার্ভারহীন
            হওয়ায়, ফায়ারবেস ক্লাউড সার্ভার কনফিগারেশনের প্রযুক্তিগত বিষয়ে
            চিন্তা করার প্রয়োজনীয়তা দূর করে। একটি Google ক্লাউড পরিষেবা
            হিসাবে, এটি আপনাকে Google ড্রাইভ এবং পত্রকের মতো অন্যান্য Google
            পণ্য এবং বৈশিষ্ট্যগুলিতে অ্যাক্সেস দেয়৷ উদাহরণস্বরূপ, আপনি Google
            পত্রক থেকে ডামি ডেটা আমদানি করতে পারেন এবং আপনার অ্যাপ পরিবেশন করতে
            অস্থায়ীভাবে এটি ব্যবহার করতে পারেন।
          </p>
        </article>
        <article className="my-5">
          <h1 className="text-4xl font-semibold">
            What other services does firebase provide other than authentication
          </h1>
          <hr className="my-2" />
          <p>
            Parse: পার্স হল একটি ব্যাপক অ্যাপ্লিকেশন স্ট্যাক যা আপনাকে দ্রুত
            অ্যাপ্লিকেশন তৈরি করতে সাহায্য করবে। এটি একটি ওপেন সোর্স ব্যাকএন্ড
            ফ্রেমওয়ার্ক যা বিনামূল্যে ব্যবহার এবং ডাউনলোড করা যায়। এটি একটি
            দুর্দান্ত ফ্রি ফায়ারবেস বিকল্প।
          </p>{" "}
          <br />
          <p>
            AWS Amplify: AWS অ্যামপ্লিফাই ওয়েব এবং মোবাইল ডেভেলপারদের
            ফিট-টু-উদ্দেশ্যের সরঞ্জাম এবং বৈশিষ্ট্যগুলির সাথে সম্পূর্ণ-স্ট্যাক
            অ্যাপ্লিকেশন তৈরি করতে দেয়। AWS Amplify ব্যবহার করে একটি
            অ্যাপ্লিকেশন তৈরি করা সহজ এবং ব্যাকএন্ড তৈরি করা, এটিকে
            অ্যাপ্লিকেশনের সাথে সংযুক্ত করা, ব্যবহারকারীদের পরিচালনা করা এবং UI
            তৈরি করার মতো পদক্ষেপগুলি জড়িত৷
          </p>{" "}
          <br />
          <p>
            Backendless: ব্যাকেন্ডলেস একটি ভিজ্যুয়াল অ্যাপ্লিকেশন ডেভেলপমেন্ট
            প্ল্যাটফর্ম। এটি 2012 সাল থেকে কাজ করছে, এবং এটি চালু করা পরিষেবা
            সমাধান হিসাবে প্রথম ব্যাকএন্ডগুলির মধ্যে একটি। ব্যাকেন্ডলেস ব্যবহার
            করে, সাধারণভাবে রিয়েলটাইম অ্যাপ্লিকেশন, অবস্থান-সচেতন অ্যাপ, মোবাইল
            এবং ওয়েব অ্যাপ তৈরি করা সম্ভব। ভিজ্যুয়াল অ্যাপ নির্মাতা অ্যাপ
            বিকাশের অভিজ্ঞতাকে স্বজ্ঞাত, পরিচালনা করা সহজ এবং দ্রুত করে তোলে।
          </p>{" "}
          <br />
        </article>
      </div>
    </div>
  );
};

export default Blogs;
